Ret395/bulk/kOmegaSST/mesh2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         1500;

deltaT          0.01;

writeControl    timeStep;

writeInterval   100;

purgeWrite      4;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//adjustTimeStep  yes;
//maxCo           0.01;


functions
{
    #include "scalar"
    residuals
    {
        type           residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled        true;
        writeControl   timeStep;
        writeInterval  1;
        fields
        (
            U
            p_rgh
            h
            k
            omega
            T0025
            T071
            T1
            T2
            T5
            T7
            T10
        );
    }
    #includeFunc yPlus
    #includeFunc totalEnthalpy
    volFieldValue1
    {
        type        volFieldValue;
        libs        ("libfieldFunctionObjects.so");
        writeFields no;
        regionType  all;
        operation   volAverage;
        fields      (U p_rgh h k omega T T0025 T071 T1 T2 T5 T7 T10);
    }
};
